## Read/Write CSV/Excel

In [ ]:
# VS code crashed, lost some of this file
import pandas as pd

df = pd.read_csv("data/stock_data.csv")
df = pd.read_csv(
    "data/stock_data.csv",
    header=None,
    names=["tickers", "eps", "revenue", "price", "people"],
    # nrows=3 #limit rows in df
    # na_values=["not available", "n.a."] # set values to NaN (how also set -1 in rev?)
    na_values={
        "eps": ["not available", "n.a."],
        "revenue": ["not available", "n.a.", -1],
        "people": ["n.a."],
    },
)
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [10]:
# write
# df.to_csv("data/new.csv")
df.to_csv("data/new.csv", index=False)

In [12]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [ ]:
# df.to_csv("data/new.csv", columns=['tickers', 'eps'])
df.to_csv("data/new.csv", columns=["tickers", "eps"], header=False)

In [ ]:
# excel
# WMT person is n.a., use converter
def convert_people_cell(cell):
    if cell == "n.a.":
        return "sam walton"  # should look at ticker too, but just for example
    return cell


def convert_eps_cell(cell):
    if cell == "not available":
        return None
    return cell


df = pd.read_excel(
    "data/stock_data.xlsx",
    "Sheet1",
    converters={"people": convert_people_cell, "eps": convert_eps_cell},
)
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

In [33]:
# df.to_excel("data/new.xlsx", sheet_name="stocks")
df.to_excel("data/new.xlsx", sheet_name="stocks", startrow=1, startcol=2, index=False)

In [ ]:
df_stocks = pd.DataFrame(
    {
        "tickers": ["GOOGL", "WMT", "MSFT"],
        "price": [845, 65, 64],
        "pe": [30.37, 14.26, 30.97],
        "eps": [27.82, 4.61, 2.12],
    }
)

df_weather = pd.DataFrame(
    {
        "day": ["1/1/2017", "1/2/2017", "1/3/2017"],
        "temperature": [32, 35, 28],
        "event": ["Rain", "Sunny", "Snow"],
    }
)

# ExcelWriter documentation: http://xlsxwriter.readthedocs.io/working_with_pandas.html
# make one excel with two sheets
with pd.ExcelWriter("data/stocks_weather.xlsx") as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")